SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
/***************************************************************************//**
 * @file sparkfun_hr_po_max30101_max32664.c
 * @brief This is a Library written for the MAXIM 32664 Biometric Sensor Hub
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided \'as-is\', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *******************************************************************************
 *
 * EVALUATION QUALITY
 * This code has been minimally tested to ensure that it builds with the
 * specified dependency versions and is suitable as a demonstration for
 * evaluation purposes only.
 * This code will be maintained at the sole discretion of Silicon Labs.
 *
 ******************************************************************************/
#include <stdlib.h>

#include "sl_status.h"
#include "sl_sleeptimer.h"
#include "sl_i2cspm.h"

#include "sparkfun_max30101_max32664_config.h"
#include "sparkfun_max30101_max32664.h"

#define BIO_HUB_ADDRESS           0x55

#define ENABLE_CMD_DELAY          45 // Milliseconds
#define CMD_DELAY                 6  // Milliseconds
#define MAXFAST_ARRAY_SIZE        6  // Number of bytes....
#define MAXFAST_EXTENDED_DATA     5
#define MAX30101_LED_ARRAY        12 // 4 values of 24 bit (3 byte) LED values

#define SET_FORMAT                0x00
#define READ_FORMAT               0x01 // Index Byte under Family Byte:
                                       // READ_OUTPUT_MODE (0x11)
#define WRITE_SET_THRESHOLD       0x01 // Index Byte for WRITE_INPUT(0x14)
#define WRITE_EXTERNAL_TO_FIFO    0x00

#define WRITE_FIFO_INPUT_BYTE     0x04
#define APP_MODE                  0x00
#define BOOTLOADER_MODE           0x08
#define NO_WRITE                  0x00

// Variables ------------
static sl_i2cspm_t *bio_hub_i2cspm_instance = NULL;
static uint8_t i2c_address = BIO_HUB_ADDRESS;
static bio_hub_algo_mode_t user_selected_mode;
static uint8_t sample_rate = 100;

// Private functions------------
static sl_status_t read_version(uint8_t family,
                                uint8_t index,
                                bio_hub_version_t *vers);
static sl_status_t enable_write(uint8_t family_byte,
                                uint8_t index_byte,
                                uint8_t enable_byte);
static sl_status_t write_byte(uint8_t family_byte,
                              uint8_t index_byte,
                              uint8_t write_byte);
static sl_status_t write_byte2(uint8_t family_byte,
                               uint8_t index_byte,
                               uint8_t write_byte,
                               uint8_t write_val);
static sl_status_t write_long_bytes(uint8_t family_byte,
                                    uint8_t index_byte,
                                    uint8_t write_byte,
                                    const int32_t *write_val,
                                    const size_t size);
static sl_status_t write_bytes(uint8_t family_byte,
                               uint8_t index_byte,
                               uint8_t write_byte,
                               const uint8_t *write_val,
                               size_t size);
static sl_status_t read_byte(uint8_t family_byte,
                             uint8_t index_byte,
                             uint8_t *byte_read);
static sl_status_t read_byte2(uint8_t family_byte,
                              uint8_t index_byte,
                              uint8_t write_byte,
                              uint8_t *byte_read);
static sl_status_t read_multiple_bytes_int(uint8_t family_byte,
                                           uint8_t index_byte,
                                           uint8_t write_byte,
                                           const size_t num_of_reads,
                                           int32_t *user_array);
static sl_status_t read_multiple_bytes(uint8_t family_byte,
                                       uint8_t index_byte,
                                       uint8_t write_byte,
                                       const size_t num_of_reads,
                                       uint8_t *user_array);
static sl_status_t read_fill_array(uint8_t family_byte,
                                   uint8_t index_byte,
                                   uint8_t num_of_reads,
                                   uint8_t *array);

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_DEVICE_MODE (0x02) Index Byte: 0x00, Write Byte: 0x00
 *    The following function initializes the sensor. To place the MAX32664 into
 *    application mode, the MFIO pin must be pulled HIGH while the board is held
 *    in reset for 10ms. After 50 additional ms have elapsed the board should be
 *    in application mode and will return two bytes,
 *    the first 0x00 is a successful communication byte,
 *    followed by 0x00 which is the byte indicating which mode the IC is in.
 *
 * @param[out] status
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_init(sl_i2cspm_t *i2cspm_instance, uint8_t address)
{
  uint8_t response_byte;
  sl_status_t sc;

  if (i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  bio_hub_i2cspm_instance = i2cspm_instance;
  if (address) {
    i2c_address = address;
  }

  // The following function initializes the sensor. To place the MAX32664 into
  // application mode, the MFIO pin must be pulled HIGH while the board is held
  // in reset for 10ms. After 50 addtional ms have elapsed the board should be
  // in application mode and will return two bytes, the first 0x00 is a
  // successful communcation byte, followed by 0x00 which is the byte indicating
  // which mode the IC is in.
#if defined(CONFIG_BIO_HUB_RESET_PORT) && defined(CONFIG_BIO_HUB_RESET_PIN)
  GPIO_PinModeSet(CONFIG_BIO_HUB_RESET_PORT,
                  CONFIG_BIO_HUB_RESET_PIN,
                  gpioModePushPull,
                  0);
#endif
#if defined(CONFIG_BIO_HUB_MFIO_PORT) && defined(CONFIG_BIO_HUB_MFIO_PIN)
  GPIO_PinModeSet(CONFIG_BIO_HUB_MFIO_PORT,
                  CONFIG_BIO_HUB_MFIO_PIN,
                  gpioModePushPull,
                  1);
#endif

