SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
#if defined(CONFIG_BIO_HUB_MFIO_PORT) && defined(CONFIG_BIO_HUB_MFIO_PIN)
  GPIO_PinOutSet(CONFIG_BIO_HUB_MFIO_PORT, CONFIG_BIO_HUB_MFIO_PIN);
#endif
#if defined(CONFIG_BIO_HUB_RESET_PORT) && defined(CONFIG_BIO_HUB_RESET_PIN)
  GPIO_PinOutClear(CONFIG_BIO_HUB_RESET_PORT, CONFIG_BIO_HUB_RESET_PIN);
  sl_sleeptimer_delay_millisecond(10);
  GPIO_PinOutSet(CONFIG_BIO_HUB_RESET_PORT, CONFIG_BIO_HUB_RESET_PIN);
  sl_sleeptimer_delay_millisecond(1000);
#endif
#if defined(CONFIG_BIO_HUB_MFIO_PORT) && defined(CONFIG_BIO_HUB_MFIO_PIN)
  GPIO_PinModeSet(CONFIG_BIO_HUB_MFIO_PORT,
                  CONFIG_BIO_HUB_MFIO_PIN,
                  gpioModeInputPull,
                  1); // To be used as an interrupt later
#endif

  sc = read_byte(READ_DEVICE_MODE, 0x00, &response_byte);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  return response_byte == 0 ? SL_STATUS_OK:SL_STATUS_FAIL;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_DEVICE_MODE (0x02) Index Byte: 0x00, Write Byte: 0x00
 *    The following function puts the MAX32664 into bootloader mode.
 *    To place the MAX32664 into bootloader mode,
 *    the MFIO pin must be pulled LOW while the board is held in reset for 10ms.
 *    After 50 addtional ms have elapsed the board should be in bootloader mode
 *    and will return two bytes, the first 0x00 is a successful communcation
 *    byte, followed by 0x08 which is the byte indicating
 *    that the board is in bootloader mode.
 *
 * @param[in] i2cspm_instance
 *    I2C instance
 * @param[in] address
 *    Device address, default is 0x55
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
#if defined(CONFIG_BIO_HUB_RESET_PORT) && defined(CONFIG_BIO_HUB_RESET_PIN) \
  && defined(CONFIG_BIO_HUB_MFIO_PORT) && defined(CONFIG_BIO_HUB_MFIO_PIN)
sl_status_t bio_hub_init_bootloader_mode(sl_i2cspm_t *i2cspm_instance,
                                         uint8_t address)
{
  uint8_t response_byte;
  sl_status_t sc;

  if (i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  bio_hub_i2cspm_instance = i2cspm_instance;
  i2c_address = address;

  GPIO_PinModeSet(CONFIG_BIO_HUB_RESET_PORT,
                  CONFIG_BIO_HUB_RESET_PIN,
                  gpioModePushPull,
                  0);
  GPIO_PinModeSet(CONFIG_BIO_HUB_MFIO_PORT,
                  CONFIG_BIO_HUB_MFIO_PIN,
                  gpioModePushPull,
                  1);

  GPIO_PinOutClear(CONFIG_BIO_HUB_MFIO_PORT, CONFIG_BIO_HUB_MFIO_PIN);
  GPIO_PinOutClear(CONFIG_BIO_HUB_RESET_PORT, CONFIG_BIO_HUB_RESET_PIN);
  sl_sleeptimer_delay_millisecond(10);
  GPIO_PinOutSet(CONFIG_BIO_HUB_RESET_PORT, CONFIG_BIO_HUB_RESET_PIN);
  sl_sleeptimer_delay_millisecond(50);
  // Bootloader mode is enabled when this ends.

  // Let's check to see if the device made it into bootloader mode.
  sc = read_byte(READ_DEVICE_MODE, 0x00, &response_byte);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  return SL_STATUS_OK;
}

#endif

/***************************************************************************//**
 * @brief
 *    Family Byte: HUB_STATUS (0x00),
 *    Index Byte: 0x00,
 *    No Write Byte.
 *    The following function checks the status of the FIFO.
 *
 * @param[out] status
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_sensor_hub_status(uint8_t *status)
{
  if (status == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte(0x00, 0x00, status); // Just family and index byte.
}

/***************************************************************************//**
 * @brief
 *    This function sets very basic settings to get sensor and biometric data.
 *    The biometric data includes data about heartrate, the confidence
 *    level, SpO2 levels, and whether the sensor has detected a finger or not.
 *
 * @param[in] mode
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_config_bpm(bio_hub_algo_mode_t mode)
{
  sl_status_t sc;

  if (mode > BIO_HUB_ALGO_MODE_TWO) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Just the data
  sc = bio_hub_set_output_mode(BIO_HUB_OUTPUT_MODE_ALGO_DATA);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // One sample before interrupt is fired.
  sc = bio_hub_set_fifo_threshold(0x01);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // One sample before interrupt is fired.
  sc = bio_hub_agc_algo_control(true);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  sc = bio_hub_max30101_control(true);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  sc = bio_hub_maxim_fast_algo_control(mode);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  user_selected_mode = mode;
  sc = bio_hub_read_algo_samples(&sample_rate);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  sl_sleeptimer_delay_millisecond(1000);
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function sets very basic settings to get LED count values from
 *    the MAX30101. Sensor data includes 24 bit LED values for
 *    the three LED channels: Red, IR, and Green.
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_config_sensor(void)
{
  sl_status_t sc; // Our status chauffeur

  // Just the sensor data (LED)
  sc = bio_hub_set_output_mode(BIO_HUB_OUTPUT_MODE_SENSOR_DATA);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // One sample before interrupt is fired to the MAX32664
  sc = bio_hub_set_fifo_threshold(0x01);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // Enable Sensor.
  sc = bio_hub_max30101_control(true);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // Enable algorithm
  sc = bio_hub_maxim_fast_algo_control(BIO_HUB_ALGO_MODE_ONE);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

