SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  sl_sleeptimer_delay_millisecond(1000);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function sets very basic settings to get sensor and biometric data.
 *    Sensor data includes 24 bit LED values for the two LED channels:
 *    Red and IR.
 *    The biometric data includes data about heartrate, the confidence
 *    level, SpO2 levels, and whether the sensor has detected a finger or not.
 *    Of note, the number of samples is set to one.
 *
 * @param[in] mode
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_config_sensor_bpm(uint8_t mode)
{
  sl_status_t sc;

  if (mode > BIO_HUB_ALGO_MODE_TWO) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Data and sensor data
  sc = bio_hub_set_output_mode(BIO_HUB_OUTPUT_MODE_SENSOR_AND_ALGORITHM);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // One sample before interrupt is fired to the MAX32664
  sc = bio_hub_set_fifo_threshold(0x01);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // Enable Sensor.
  sc = bio_hub_max30101_control(true);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // Enable algorithm
  sc = bio_hub_maxim_fast_algo_control(mode);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  user_selected_mode = mode;
  sc = bio_hub_read_algo_samples(&sample_rate);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  sl_sleeptimer_delay_millisecond(1000);
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function takes the 8 bytes from the FIFO buffer related to the wrist
 *    heart rate algortihm: heart rate (uint16_t), confidence (uint8_t) ,
 *    SpO2 (uint16_t), and the finger detected status (uint8_t).
 *    Note that the the algorithm is stated as "wrist" though
 *    the sensor only works with the finger.
 *    The data is loaded into the whrmFifo and returned.
 *
 * @param[out] lib_bpm
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_bpm(bio_hub_data_t *lib_bpm)
{
  uint8_t status_chauf; // The status chauffeur captures return values.
  sl_status_t sc;
  uint8_t samp_avail;

  if (lib_bpm == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  sc = bio_hub_read_sensor_hub_status(&status_chauf);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // Communication Error
  if (status_chauf == 1) {
    sc = SL_STATUS_FAIL;
    goto error;
  }

  sc = bio_hub_num_samples_out_fifo(&samp_avail);
  if (SL_STATUS_OK != sc) {
    goto error;
  }

  if (user_selected_mode == BIO_HUB_ALGO_MODE_ONE) {
    uint8_t bpm_arr[MAXFAST_ARRAY_SIZE + 1];

    sc = read_fill_array(READ_DATA_OUTPUT, READ_DATA, sizeof(bpm_arr), bpm_arr);
    if (SL_STATUS_OK != sc) {
      goto error;
    }

    // SUCCESS: 0x00
    if (bpm_arr[0]) {
      sc = SL_STATUS_FAIL;
      goto error;
    }

    // Heart Rate formatting
    lib_bpm->heart_rate = (uint16_t)bpm_arr[1] << 8;
    lib_bpm->heart_rate |= (bpm_arr[2]);
    lib_bpm->heart_rate /= 10;

    // Confidence formatting
    lib_bpm->confidence = bpm_arr[3];

    // Blood oxygen level formatting
    lib_bpm->oxygen = (uint16_t)bpm_arr[4] << 8;
    lib_bpm->oxygen |= bpm_arr[5];
    lib_bpm->oxygen /= 10;

    // "Machine State" - has a finger been detected?
    lib_bpm->status = bpm_arr[6];

    return SL_STATUS_OK;
  } else if (user_selected_mode == BIO_HUB_ALGO_MODE_TWO) {
    uint8_t bpm_arr_two[MAXFAST_ARRAY_SIZE + MAXFAST_EXTENDED_DATA + 1];

    sc = read_fill_array(READ_DATA_OUTPUT, READ_DATA,
                         sizeof(bpm_arr_two),
                         bpm_arr_two);
    if (SL_STATUS_OK != sc) {
      goto error;
    }

    // SUCCESS: 0x00
    if (bpm_arr_two[0]) {
      sc = SL_STATUS_FAIL;
      goto error;
    }

    // Heart Rate formatting
    lib_bpm->heart_rate = (uint16_t)bpm_arr_two[1] << 8;
    lib_bpm->heart_rate |= (bpm_arr_two[2]);
    lib_bpm->heart_rate /= 10;

    // Confidence formatting
    lib_bpm->confidence = bpm_arr_two[3];

    // Blood oxygen level formatting
    lib_bpm->oxygen = (uint16_t)bpm_arr_two[4] << 8;
    lib_bpm->oxygen |= bpm_arr_two[5];
    lib_bpm->oxygen /= 10.0;

    // "Machine State" - has a finger been detected?
    lib_bpm->status = bpm_arr_two[6];

    // Sp02 r Value formatting
    uint16_t tempVal = (uint16_t)bpm_arr_two[7] << 8;
    tempVal |= bpm_arr_two[8];
    lib_bpm->r_value = tempVal;
    lib_bpm->r_value /= 10.0;

    // Extended Machine State formatting
    lib_bpm->ext_status = bpm_arr_two[9];

    // There are two additional bytes of data that were requested but that
    // have not been implemented in firmware 10.1 so will not be saved to
    // user's data.
    return SL_STATUS_OK;
  } else {
    lib_bpm->heart_rate = 0;
    lib_bpm->confidence = 0;
    lib_bpm->oxygen = 0;
    return SL_STATUS_FAIL;
  }

  error:
  lib_bpm->heart_rate = 0;
  lib_bpm->confidence = 0;
  lib_bpm->oxygen = 0;
  return sc;
}

/***************************************************************************//**
 * @brief
 *    This function takes 9 bytes of LED values from the MAX30101
 *    associated with the RED, IR, and GREEN LEDs.
 *    In addition it gets the 8 bytes from the FIFO buffer related to
 *    the wrist heart rate algortihm: heart rate (uint16_t),
 *    confidence (uint8_t), SpO2 (uint16_t),
 *    and the finger detected status (uint8_t). Note that the the algorithm
 *    is stated as "wrist" though the sensor only works with the finger.
 *    The data is loaded into the whrmFifo and returned.
 *
 * @param[out] lib_led_fifo
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_sensor(bio_hub_data_t *lib_led_fifo)
{
  sl_status_t sc;
  uint8_t sen_arr[MAX30101_LED_ARRAY + 1];

  if (lib_led_fifo == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  sc = read_fill_array(READ_DATA_OUTPUT, READ_DATA, sizeof(sen_arr), sen_arr);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // SUCCESS: 0x00
  if (sen_arr[0]) {
    return SL_STATUS_FAIL;
  }

  // Value of LED one....
  lib_led_fifo->ir_led = (uint32_t)sen_arr[1] << 16;
  lib_led_fifo->ir_led |= (uint32_t)sen_arr[2] << 8;
  lib_led_fifo->ir_led |= sen_arr[3];

  // Value of LED two...
  lib_led_fifo->red_led = (uint32_t)sen_arr[4] << 16;
  lib_led_fifo->red_led |= (uint32_t)sen_arr[5] << 8;
  lib_led_fifo->red_led |= sen_arr[6];

