SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function takes the information of both the LED value and
 *    the biometric data from the MAX32664's FIFO.
 *    In essence it combines the two functions
 *    above into a single function call.
 *
 * @param[out] lib_led_bpm
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_sensor_bpm(bio_hub_data_t *lib_led_bpm)
{
  sl_status_t sc;
  uint8_t bpm_sen_arr[MAXFAST_ARRAY_SIZE + MAX30101_LED_ARRAY + 1];

  if (lib_led_bpm == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (user_selected_mode == BIO_HUB_ALGO_MODE_ONE) {
    sc = read_fill_array(READ_DATA_OUTPUT,
                         READ_DATA,
                         MAXFAST_ARRAY_SIZE + MAX30101_LED_ARRAY,
                         bpm_sen_arr);
    if (SL_STATUS_OK != sc) {
      return sc;
    }

    // SUCCESS: 0x00
    if (bpm_sen_arr[0]) {
      return SL_STATUS_FAIL;
    }

    // Value of LED one....
    lib_led_bpm->ir_led = (uint32_t)bpm_sen_arr[1] << 16;
    lib_led_bpm->ir_led |= (uint32_t)bpm_sen_arr[2] << 8;
    lib_led_bpm->ir_led |= bpm_sen_arr[3];

    // Value of LED two...
    lib_led_bpm->red_led = (uint32_t)bpm_sen_arr[4] << 16;
    lib_led_bpm->red_led |= (uint32_t)bpm_sen_arr[5] << 8;
    lib_led_bpm->red_led |= bpm_sen_arr[6];

    // -- What happened here? -- There are two uint32_t values that are given by
    // the sensor for LEDs that do not exists on the MAX30101. So we have to
    // request those empty values because they occupy the buffer:
    // bpm_sen_arr[6-11].

    // Heart rate formatting
    lib_led_bpm->heart_rate = (uint16_t)bpm_sen_arr[13] << 8;
    lib_led_bpm->heart_rate |= (bpm_sen_arr[14]);
    lib_led_bpm->heart_rate /= 10;

    // Confidence formatting
    lib_led_bpm->confidence = bpm_sen_arr[15];

    // Blood oxygen level formatting
    lib_led_bpm->oxygen = (uint16_t)bpm_sen_arr[16] << 8;
    lib_led_bpm->oxygen |= bpm_sen_arr[17];
    lib_led_bpm->oxygen /= 10;

    // "Machine State" - has a finger been detected?
    lib_led_bpm->status = bpm_sen_arr[18];

    return SL_STATUS_OK;
  } else if (user_selected_mode == BIO_HUB_ALGO_MODE_TWO) {
    uint8_t bpm_sen_arr_two[MAXFAST_ARRAY_SIZE
                            + MAXFAST_EXTENDED_DATA
                            + MAX30101_LED_ARRAY + 1];

    sc = read_fill_array(READ_DATA_OUTPUT, READ_DATA,
                         sizeof(bpm_sen_arr_two),
                         bpm_sen_arr_two);
    if (SL_STATUS_OK != sc) {
      return sc;
    }

    // SUCCESS: 0x00
    if (bpm_sen_arr_two[0]) {
      return SL_STATUS_FAIL;
    }

    // Value of LED one....
    lib_led_bpm->ir_led = (uint32_t)bpm_sen_arr_two[1] << 16;
    lib_led_bpm->ir_led |= (uint32_t)bpm_sen_arr_two[2] << 8;
    lib_led_bpm->ir_led |= bpm_sen_arr_two[3];

    // Value of LED two...
    lib_led_bpm->red_led = (uint32_t)bpm_sen_arr_two[4] << 16;
    lib_led_bpm->red_led |= (uint32_t)bpm_sen_arr_two[5] << 8;
    lib_led_bpm->red_led |= bpm_sen_arr_two[6];

    // -- What happened here? -- There are two uint32_t values that are given by
    // the sensor for LEDs that do not exists on the MAX30101. So we have to
    // request those empty values because they occupy the buffer:
    // bpm_sen_arr_two[6-11].

    // Heart rate formatting
    lib_led_bpm->heart_rate = (uint16_t)bpm_sen_arr_two[13] << 8;
    lib_led_bpm->heart_rate |= bpm_sen_arr_two[14];
    lib_led_bpm->heart_rate /= 10;

    // Confidence formatting
    lib_led_bpm->confidence = bpm_sen_arr_two[15];

    // Blood oxygen level formatting
    lib_led_bpm->oxygen = (uint16_t)bpm_sen_arr_two[16] << 8;
    lib_led_bpm->oxygen |= bpm_sen_arr_two[17];
    lib_led_bpm->oxygen /= 10;

    // "Machine State" - has a finger been detected?
    lib_led_bpm->status = bpm_sen_arr_two[18];

    // Sp02 r Value formatting
    uint16_t tempVal = (uint16_t)bpm_sen_arr_two[19] << 8;
    tempVal |= bpm_sen_arr_two[20];
    lib_led_bpm->r_value = tempVal;
    lib_led_bpm->r_value /= 10.0;

    // Extended Machine State formatting
    lib_led_bpm->ext_status = bpm_sen_arr_two[21];

    // There are two additional bytes of data that were requested but that
    // have not been implemented in firmware 10.1 so will not be saved to
    // user's data.
    //
    return SL_STATUS_OK;
  } else {
    lib_led_bpm->ir_led = 0;
    lib_led_bpm->red_led = 0;
    lib_led_bpm->heart_rate = 0;
    lib_led_bpm->confidence = 0;
    lib_led_bpm->oxygen = 0;
    lib_led_bpm->status = 0;
    lib_led_bpm->r_value = 0;
    lib_led_bpm->ext_status = 0;

    return SL_STATUS_FAIL;
  }
}

/***************************************************************************//**
 * @brief
 *    This function modifies the pulse width of the MAX30101 LEDs.
 *    All of the LEDs are modified to the same width.
 *    This will affect the number of samples that can be collected
 *    and will also affect the ADC resolution.
 *    Width(us) - Resolution -  Sample Rate
 *    Default: 69us - 15 resolution - 50 samples per second.
 *      69us     -    15      -   <= 3200 (fastest - least resolution)
 *      118us    -    16      -   <= 1600
 *      215us    -    17      -   <= 1600
 *      411us    -    18      -   <= 1000 (slowest - highest resolution)
 *
 * @param[in] width
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_pulse_width(max30101_pulse_width_t width)
{
  sl_status_t sc;
  uint8_t bits;
  uint8_t reg_val;

  // Make sure the correct pulse width is selected.
  if (width == MAX30101_PULSE_WIDTH_69) {
    bits = 0;
  } else if (width == MAX30101_PULSE_WIDTH_118) {
    bits = 1;
  } else if (width == MAX30101_PULSE_WIDTH_215) {
    bits = 2;
  } else if (width == MAX30101_PULSE_WIDTH_411) {
    bits = 3;
  } else {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get current register value so that nothing is overwritten.
  sc = bio_hub_read_register_max30101(MAX30101_CONFIGURATION_REGISTER,
                                      &reg_val);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  reg_val &= MAX30101_PULSE_MASK; // Mask bits to change.
  reg_val |= bits; // Add bits
  // Write Register
  bio_hub_write_register_max30101(MAX30101_CONFIGURATION_REGISTER, reg_val);

