SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function reads the MAX30101_CONFIGURATION_REGISTER (0x0A), bits [1:0]
 *    from the MAX30101 Sensor.
 *    It returns one of the four settings in microseconds.
 *
 * @param[out] width
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_pulse_width(uint16_t *width)
{
  sl_status_t sc;
  uint8_t reg_val;

  if (width == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  sc = bio_hub_read_register_max30101(MAX30101_CONFIGURATION_REGISTER,
                                      &reg_val);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  reg_val &= MAX30101_READ_PULSE_MASK;

  if (reg_val == 0) {
    *width = 69;
  } else if (reg_val == 1) {
    *width = 118;
  } else if (reg_val == 2) {
    *width = 215;
  } else if (reg_val == 3) {
    *width = 411;
  } else {
    return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function changes the sample rate of the MAX30101 sensor. The sample
 *    rate is affected by the set pulse width of the MAX30101 LEDs.
 *    Default: 69us - 15 resolution - 50 samples per second.
 *    Width(us) - Resolution -  Sample Rate
 *      69us     -    15      -   <= 3200 (fastest - least resolution)
 *      118us    -    16      -   <= 1600
 *      215us    -    17      -   <= 1600
 *      411us    -    18      -   <= 1000 (slowest - highest resolution)
 *    Samples Options:
 *    50, 100, 200, 400, 800, 1000, 1600, 3200
 *
 * @param[in] samp_rate
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_sample_rate(max30101_sample_rate_t samp_rate)
{
  sl_status_t sc;
  uint8_t bits;
  uint8_t reg_val;

  // Make sure the correct sample rate was picked
  if (samp_rate == MAX30101_SAMPLE_RATE_50) {
    bits = 0;
  } else if (samp_rate == MAX30101_SAMPLE_RATE_100) {
    bits = 1;
  } else if (samp_rate == MAX30101_SAMPLE_RATE_200) {
    bits = 2;
  } else if (samp_rate == MAX30101_SAMPLE_RATE_400) {
    bits = 3;
  } else if (samp_rate == MAX30101_SAMPLE_RATE_800) {
    bits = 4;
  } else if (samp_rate == MAX30101_SAMPLE_RATE_1000) {
    bits = 5;
  } else if (samp_rate == MAX30101_SAMPLE_RATE_1600) {
    bits = 6;
  } else if (samp_rate == MAX30101_SAMPLE_RATE_3200) {
    bits = 7;
  } else {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get current register value so that nothing is overwritten.
  sc = bio_hub_read_register_max30101(MAX30101_CONFIGURATION_REGISTER,
                                      &reg_val);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  reg_val &= MAX30101_SAMP_MASK; // Mask bits to change.
  reg_val |= (bits << 2); // Add bits but shift them first to correct position.
  // Write Register
  bio_hub_write_register_max30101(MAX30101_CONFIGURATION_REGISTER, reg_val);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function reads the MAX30101_CONFIGURATION_REGISTER (0x0A),
 *    bits [4:2] from the MAX30101 Sensor.
 *    It returns one of the 8 possible sample rates.
 *
 * @param[out] samp_rate
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_sample_rate(uint16_t *samp_rate)
{
  sl_status_t sc;
  uint8_t reg_val;

  if (samp_rate == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  sc = bio_hub_read_register_max30101(MAX30101_CONFIGURATION_REGISTER,
                                      &reg_val);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  reg_val &= MAX30101_READ_SAMP_MASK;
  reg_val = (reg_val >> 2);

  if (reg_val == 0) {
    *samp_rate = 50;
  } else if (reg_val == 1) {
    *samp_rate = 100;
  } else if (reg_val == 2) {
    *samp_rate = 200;
  } else if (reg_val == 3) {
    *samp_rate = 400;
  } else if (reg_val == 4) {
    *samp_rate = 800;
  } else if (reg_val == 5) {
    *samp_rate = 1000;
  } else if (reg_val == 6) {
    *samp_rate = 1600;
  } else if (reg_val == 7) {
    *samp_rate = 3200;
  } else {
    return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    MAX30101 Register: MAX30101_CONFIGURATION_REGISTER (0x0A), bits [6:5]
 *    This functions sets the dynamic range of the MAX30101's ADC. The function
 *    accepts the higher range as a parameter.
 *    Default Range: 7.81pA - 2048nA
 *    Possible Ranges:
 *    7.81pA  - 2048nA
 *    15.63pA - 4096nA
 *    32.25pA - 8192nA
 *    62.5pA  - 16384nA
 *
 * @param[in] adc_val
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_adc_range(uint16_t adc_val)
{
  sl_status_t sc;
  uint8_t reg_val;
  uint8_t bits;

  if (adc_val <= 2048) {
    bits = 0;
  } else if (adc_val <= 4096) {
    bits = 1;
  } else if (adc_val <= 8192) {
    bits = 2;
  } else if (adc_val <= 16384) {
    bits = 3;
  } else {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sc = bio_hub_read_register_max30101(MAX30101_CONFIGURATION_REGISTER,
                                      &reg_val);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  reg_val &= MAX30101_ADC_MASK;
  reg_val |= bits << 5;

  sc = bio_hub_write_register_max30101(MAX30101_CONFIGURATION_REGISTER,
                                       reg_val);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    MAX30101 Register: MAX30101_CONFIGURATION_REGISTER (0x0A), bits [6:5]
 *    This function returns the set ADC range of the MAX30101 sensor.
 *
 * @param[out] adc_val
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_adc_range(uint16_t *adc_val)
{
  sl_status_t sc;
  uint8_t reg_val;

  if (adc_val == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

