SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  sc = bio_hub_read_register_max30101(MAX30101_CONFIGURATION_REGISTER,
                                      &reg_val);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  reg_val &= MAX30101_READ_ADC_MASK;
  reg_val = (reg_val >> 5); // Shift our bits to the front of the line.

  if (reg_val == 0) {
    *adc_val = 2048;
  } else if (reg_val == 1) {
    *adc_val = 4096;
  } else if (reg_val == 2) {
    *adc_val = 8192;
  } else if (reg_val == 3) {
    *adc_val = 16384;
  } else {
    return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: SET_DEVICE_MODE (0x01),
 *    Index Byte: 0x01,
 *    Write Byte: 0x00
 *    The following function is an alternate way to set the mode of the of
 *    MAX32664. It can take three parameters: Enter and Exit Bootloader Mode, as
 *    well as reset.
 *
 * @param[in] selection
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_operating_mode(
  bio_hub_device_mode_write_byte_t selection)
{
  sl_status_t sc;
  uint8_t response_byte;

  // Must be one of the three....
  if ((selection != BIO_HUB_EXIT_BOOTLOADER)
      && (selection != BIO_HUB_RESET)
      && (selection != BIO_HUB_ENTER_BOOTLOADER)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sc = write_byte(SET_DEVICE_MODE, 0x00, selection);
  if (SL_STATUS_OK != sc) {
    return sc;
  }

  // Here we'll check if the board made it into Bootloader mode...
  // This is in fact the status byte,
  // need second returned byte - bootloader mode
  sc = read_byte(READ_DEVICE_MODE, 0x00, &response_byte);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  return (response_byte == SUCCESS) ? SL_STATUS_OK : SL_STATUS_FAIL;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: IDENTITY (0x01),
 *    Index Byte: READ_MCU_TYPE,
 *    Write Byte: NONE
 *    The following function returns a byte that signifies the microcontoller
 *    that is in communcation with your host microcontroller.
 *    Returns 0x00 for the MAX32625 and 0x01 for the MAX32660/MAX32664.
 *
 * @param[in] return_byte
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_get_mcu_type(uint8_t *return_byte)
{
  if (return_byte == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(IDENTITY, READ_MCU_TYPE, NO_WRITE, return_byte);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: BOOTLOADER_INFO (0x80),
 *    Index Byte: BOOTLOADER_VERS (0x00)
 *    This function checks the version number of the bootloader on the chip and
 *    returns a four bytes: Major version Byte, Minor version Byte, Space Byte,
 *    and the Revision Byte.
 *
 * @param[in] sen_switch
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_get_bootloader_inf(int32_t *boot_vers)
{
  sl_status_t sc;
  int32_t rev_num[4];

  if (boot_vers == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *boot_vers = 0;

  sc = read_multiple_bytes_int(BOOTLOADER_INFO,
                               BOOTLOADER_VERS,
                               0x00,
                               4,
                               rev_num);

  if (SL_STATUS_OK != sc) {
    return sc;
  }
  *boot_vers |= (int32_t)rev_num[1] << 16;
  *boot_vers |= (int32_t)rev_num[2] << 8;
  *boot_vers |= rev_num[3];
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: ENABLE_SENSOR (0x44),
 *    Index Byte: ENABLE_MAX30101 (0x03),
 *    Write Byte: sen_switch (parameter - 0x00 or 0x01).
 *    This function enables the MAX30101.
 *
 * @param[in] sen_switch
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_max30101_control(bool sen_switch)
{
  // Check that communication was successful, not that the sensor is enabled.
  return enable_write(ENABLE_SENSOR, ENABLE_MAX30101, sen_switch ? 1 : 0);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_SENSOR_MODE (0x45),
 *    Index Byte: READ_ENABLE_MAX30101 (0x03)
 *    This function checks if the MAX30101 is enabled or not.
 *
 * @param[in] state
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_max30101_state(uint8_t *state)
{
  if (state == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte(READ_SENSOR_MODE, READ_ENABLE_MAX30101, state);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: ENABLE_SENSOR (0x44),
 *    Index Byte: ENABLE_ACCELEROMETER (0x04),
 *    Write Byte: accel_switch (parameter - 0x00 or 0x01).
 *    This function enables the ACCELEROMETER.
 *
 * @param[in] accel_switch
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_accel_control(bool accel_switch)
{
  // Check that communication was successful, not that the sensor is enabled.
  return enable_write(ENABLE_SENSOR,
                      ENABLE_ACCELEROMETER,
                      accel_switch ? 1 : 0);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: OUTPUT_MODE (0x10),
 *    Index Byte: SET_FORMAT (0x00),
 *    Write Byte : output_type (Parameter values in OUTPUT_MODE_WRITE_BYTE)
 *
 * @param[in] output_type
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_output_mode(
  bio_hub_output_mode_write_byte_t output_type)
{
  // Bytes between 0x00 and 0x07
  if (output_type > BIO_HUB_OUTPUT_MODE_SENSOR_ALGO_COUNTER) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Check that communication was successful, not that the IC is outputting
  // correct format.
  return write_byte(OUTPUT_MODE, SET_FORMAT, output_type);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: OUTPUT_MODE,
 *    Index Byte: WRITE_SET_THRESHOLD,
 *    Write byte: intThres (parameter - value betwen 0 and 0xFF).
 *    This function changes the threshold for the FIFO interrupt bit/pin.
 *    The interrupt pin is the MFIO pin which is set to INPUT after
 *    IC initialization (begin).
 *
 * @param[in] int_thresh
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_fifo_threshold(uint8_t int_thresh)
{
  // Checks that there was succesful communcation, not that the threshold was
  // set correctly.
  return write_byte(OUTPUT_MODE, WRITE_SET_THRESHOLD, int_thresh);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_DATA_OUTPUT (0x12),
 *    Index Byte: NUM_SAMPLES (0x00),
 *    Write Byte: NONE
 *    This function returns the number of samples available in the FIFO.
 *
 * @param[in] samp_avail
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_num_samples_out_fifo(uint8_t *samp_avail)
{
  if (samp_avail == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte(READ_DATA_OUTPUT, NUM_SAMPLES, samp_avail);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_DATA_OUTPUT (0x12),
 *    Index Byte: READ_DATA (0x00),
 *    Write Byte: NONE
 *    This function returns the data in the FIFO.
 *
 * @param[in] buf
 * @param[in] size
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_get_data_out_fifo(uint8_t *buf, uint8_t *size)
{
  uint8_t samples;
  sl_status_t sc;

  if ((buf == NULL) || (size == NULL)) {
    return SL_STATUS_NULL_POINTER;
  }

