SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  sc = bio_hub_num_samples_out_fifo(&samples);
  if (SL_STATUS_OK != sc) {
    return sc;
  }
  if (*size < samples) {
    return SL_STATUS_WOULD_OVERFLOW;
  }
  *size = samples;
  return read_fill_array(READ_DATA_OUTPUT, READ_DATA, samples, buf);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_DATA_OUTPUT (0x12),
 *    Index Byte: READ_DATA (0x00),
 *    Write Byte: NONE
 *    This function adds support for the acceleromter that is NOT included on
 *    SparkFun's product,
 *    The Family Registery of 0x13 and 0x14 is skipped for now.
 *
 * @param[in] reg_addr
 * @param[in] reg_cont
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_num_samples_external_sensor(uint8_t *samp_avail)
{
  if (samp_avail == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(READ_DATA_INPUT,
                    SAMPLE_SIZE,
                    WRITE_ACCELEROMETER,
                    samp_avail);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: WRITE_REGISTER (0x40),
 *    Index Byte: WRITE_MAX30101 (0x03),
 *    Write Bytes: Register Address and Register Value
 *    This function writes the given register value
 *    at the given register address for the MAX30101 sensor
 *
 * @param[in] reg_addr
 * @param[in] reg_cont
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_register_max30101(uint8_t reg_addr, uint8_t reg_val)
{
  return write_byte2(WRITE_REGISTER, WRITE_MAX30101, reg_addr, reg_val);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: WRITE_REGISTER (0x40),
 *    Index Byte: WRITE_ACCELEROMETER (0x04),
 *    Write Bytes: Register Address and Register Value
 *    This function writes the given register value
 *    at the given register address for the Accelerometer
 *
 * @param[in] reg_addr
 * @param[in] reg_cont
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_register_accel(uint8_t reg_addr, uint8_t reg_val)
{
  return write_byte2(WRITE_REGISTER, WRITE_ACCELEROMETER, reg_addr, reg_val);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_REGISTER (0x41),
 *    Index Byte: READ_MAX30101 (0x03),
 *    Write Byte: Register Address
 *    This function reads the given register address for the MAX30101 Sensor and
 *    returns the values at that register.
 *
 * @param[in] reg_addr
 * @param[in] reg_cont
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_register_max30101(uint8_t reg_addr, uint8_t *reg_cont)
{
  if (reg_cont == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(READ_REGISTER, READ_MAX30101, reg_addr, reg_cont);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_REGISTER (0x41),
 *    Index Byte: READ_MAX30101 (0x03),
 *    Write Byte: Register Address
 *    This function reads the given register address for the MAX30101 Sensor and
 *    returns the values at that register.
 *
 * @param[in] reg_array
 * @param[in] reg_cont
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_register_accel(uint8_t reg_addr, uint8_t *reg_cont)
{
  if (reg_cont == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(READ_REGISTER, READ_ACCELEROMETER, reg_addr, reg_cont);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_ATTRIBUTES_AFE (0x42),
 *    Index Byte: RETRIEVE_AFE_MAX30101/ (0x03)
 *    This function retrieves the attributes of the AFE (Analog Front End) of
 *    the MAX30101 sensor. It returns the number of bytes in a word for
 *    the sensor and the number of registers available.
 *
 * @param[in] reg_array
 * @param[in] num_of_bytes
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_get_afe_attributes_max30101(bio_hub_sensor_attr_t *max_attr)
{
  uint8_t temp_array[2];
  sl_status_t sc;

  if (max_attr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  sc = read_fill_array(READ_ATTRIBUTES_AFE,
                       RETRIEVE_AFE_MAX30101,
                       2,
                       temp_array);
  max_attr->byte_word = temp_array[0];
  max_attr->avail_registers = temp_array[1];
  return sc;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_ATTRIBUTES_AFE (0x42),
 *    Index Byte: RETRIEVE_AFE_ACCELEROMETER (0x04)
 *    This function retrieves the attributes of the AFE (Analog Front End) of
 *    the Accelerometer. It returns the number of bytes in a word for the sensor
 *    and the number of registers available.
 *
 * @param[in] reg_array
 * @param[in] num_of_bytes
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_get_afe_attributes_accelerometer(
  bio_hub_sensor_attr_t *max_attr)
{
  uint8_t temp_array[2];
  sl_status_t sc;

  if (max_attr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  sc = read_fill_array(READ_ATTRIBUTES_AFE,
                       RETRIEVE_AFE_ACCELEROMETER,
                       2,
                       temp_array);
  max_attr->byte_word = temp_array[0];
  max_attr->avail_registers = temp_array[1];
  return sc;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: DUMP_REGISTERS (0x43),
 *    Index Byte: DUMP_REGISTER_MAX30101 (0x03)
 *    This function returns all registers and register values sequentially of
 *    the MAX30101 sensor: register zero and register value zero to register n
 *    and register value n. There are 36 registers in this case.
 *
 * @param[in] reg_array
 * @param[in] num_of_bytes
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_dump_register_max30101(uint8_t *reg_array,
                                           uint8_t num_of_bytes)
{
  if (reg_array == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_fill_array(DUMP_REGISTERS,
                         DUMP_REGISTER_MAX30101,
                         num_of_bytes,
                         reg_array);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: DUMP_REGISTERS (0x43),
 *    Index Byte: DUMP_REGISTER_ACCELEROMETER (0x04)
 *    This function returns all registers and register values sequentially of
 *    the Accelerometer: register zero and register value zero to register n
 *    and register value n.
 *
 * @param[in] num_reg
 * @param[in] reg_array
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_dump_register_accelerometer(uint8_t num_reg,
                                                uint8_t *reg_array)
{
  if (reg_array == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  // Fake read amount
  return read_fill_array(DUMP_REGISTERS,
                         DUMP_REGISTER_ACCELEROMETER,
                         num_reg,
                         reg_array);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: SET_TARG_PERC (0x00),
 *    Write Byte: AGC_GAIN_ID (0x00)
 *    This function sets the target percentage of the full-scale ADC range that
 *    the automatic gain control algorithm uses. It takes a paramater of zero to
 *    100 percent.
 *
 * @param[in] perc
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_algo_range(uint8_t perc)
{
  if (perc > 100) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Successful communication or no?
  return write_byte2(CHANGE_ALGORITHM_CONFIG, SET_TARG_PERC, AGC_GAIN_ID, perc);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: SET_STEP_SIZE (0x00),
 *    Write Byte: AGC_STEP_SIZE_ID (0x01)
 *    This function changes the step size
 *    toward the target for the AGC algorithm.
 *    It takes a paramater of zero to 100 percent.
 *
 * @param[in] step
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_algo_step_size(uint8_t step)
{
  if (step > 100) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Successful communication or no?
  return write_byte2(CHANGE_ALGORITHM_CONFIG,
                     SET_STEP_SIZE,
                     AGC_STEP_SIZE_ID,
                     step);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: SET_SENSITIVITY (0x00),
 *    Write Byte: AGC_SENSITIVITY_ID (0x02)
 *    This function changes the sensitivity of the AGC algorithm.
 *
 * @param[in] sense
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_algo_sensitivity(uint8_t sense)
{
  if (sense > 100) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Successful communication or no?
  return write_byte2(CHANGE_ALGORITHM_CONFIG,
                     SET_SENSITIVITY,
                     AGC_SENSITIVITY_ID,
                     sense);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: SET_AVG_SAMPLES (0x00),
 *    Write Byte: AGC_NUM_SAMP_ID (0x03)
 *    This function changes the number of samples that are averaged.
 *    It takes a paramater of zero to 255.
 *
 * @param[in] avg
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_algo_samples(uint8_t avg)
{
  // Successful communication or no?
  return write_byte2(CHANGE_ALGORITHM_CONFIG,
                     SET_AVG_SAMPLES,
                     AGC_NUM_SAMP_ID,
                     avg);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: SET_PULSE_OX_COEF (0x02),
 *    Write Byte: MAXIMFAST_COEF_ID (0x0B)
 *    This function takes three values that are used as the Sp02 coefficients.
 *
 * @param[in] coef1, coef2, coef3
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_maxim_fast_coef(int32_t coef1,
                                        int32_t coef2,
                                        int32_t coef3)
{
  int32_t coef_arr[3] = { coef1, coef2, coef3 };

  return write_long_bytes(CHANGE_ALGORITHM_CONFIG,
                          SET_PULSE_OX_COEF,
                          MAXIMFAST_COEF_ID,
                          coef_arr,
                          3);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_ALGORITHM_CONFIG (0x51),
 *    Index Byte: READ_AGC_PERCENTAGE (0x00),
 *    Write Byte: READ_AGC_PERC_ID (0x00)
 *    This function reads and returns the currently set target percentage
 *    of the full-scale ADC range
 *    that the Automatic Gain Control algorithm is using.
 *
 * @param[out] range
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_algo_range(uint8_t *range)
{
  if (range == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(READ_ALGORITHM_CONFIG,
                    READ_AGC_PERCENTAGE,
                    READ_AGC_PERC_ID,
                    range);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_ALGORITHM_CONFIG (0x51),
 *    Index Byte: READ_AGC_STEP_SIZE (0x00),
 *    Write Byte: READ_AGC_STEP_SIZE_ID (0x01)
 *    This function returns the step size toward
 *    the target for the AGC algorithm.
 *    It returns a value between zero and 100 percent.
 *
 * @param[out] step_size
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_algo_step_size(uint8_t *step_size)
{
  if (step_size == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(READ_ALGORITHM_CONFIG,
                    READ_AGC_STEP_SIZE,
                    READ_AGC_STEP_SIZE_ID,
                    step_size);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_ALGORITHM_CONFIG (0x51),
 *    Index Byte: READ_AGC_SENSITIVITY_ID (0x00),
 *    Write Byte: READ_AGC_SENSITIVITY_ID (0x02)
 *    This function returns the sensitivity (percentage)
 *    of the automatic gain control.
 *
 * @param[out] sensitivity
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_algo_sensitivity(uint8_t *sensitivity)
{
  if (sensitivity == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(READ_ALGORITHM_CONFIG,
                    READ_AGC_SENSITIVITY,
                    READ_AGC_SENSITIVITY_ID,
                    sensitivity);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_ALGORITHM_CONFIG (0x51),
 *    Index Byte: READ_AGC_NUM_SAMPLES (0x00),
 *    Write Byte: READ_AGC_NUM_SAMPlES_ID (0x03)
 *    This function changes the number of samples that are averaged.
 *    It takes a parameter of zero to 255.
 *
 * @param[out] samples
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_algo_samples(uint8_t *samples)
{
  if (samples == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  return read_byte2(READ_ALGORITHM_CONFIG,
                    READ_AGC_NUM_SAMPLES,
                    READ_AGC_NUM_SAMPLES_ID,
                    samples);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: READ_ALGORITHM_CONFIG (0x51),
 *    Index Byte: READ_MAX_FAST_COEF (0x02)
 *    Write Byte: READ_MAX_FAST_COEF_ID (0x0B)
 *    This function reads the maximum age for the wrist heart rate monitor
 *    (WHRM) algorithm. It returns three uint32_t integers that are
 *     multiplied by 100,000.
 *
 * @param[in] coef_arr
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_maxim_fast_coef(int32_t *coef_arr)
{
  sl_status_t sc;

  if (coef_arr == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sc = read_multiple_bytes_int(READ_ALGORITHM_CONFIG,
                               READ_MAX_FAST_COEF,
                               READ_MAX_FAST_COEF_ID,
                               3,
                               coef_arr);
  coef_arr[0] = coef_arr[0] * 100000;
  coef_arr[1] = coef_arr[1] * 100000;
  coef_arr[2] = coef_arr[2] * 100000;
  return sc;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: ENABLE_ALGORITHM (0x52), Index Byte: ENABLE_AGC_ALGO (0x00)
 *    This function enables (one) or disables (zero) the automatic gain control
 *    algorithm.
 *
 * @param[in] enable
 *    false: Disable
 *    true:  Enable
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_agc_algo_control(bool enable)
{
  return enable_write(ENABLE_ALGORITHM, ENABLE_AGC_ALGO, enable ? 1 : 0);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: ENABLE_ALGORITHM (0x52), Index Byte: ENABLE_WHRM_ALGO (0x02)
 *    This function enables (one)
 *    or disables (zero) the wrist heart rate monitor algorithm.
 *
 * @param[in] mode
 *    Control mode
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_maxim_fast_algo_control(bio_hub_algo_mode_t mode)
{
  if (mode > BIO_HUB_ALGO_MODE_TWO) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  return enable_write(ENABLE_ALGORITHM, ENABLE_WHRM_ALGO, mode);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: BOOTLOADER_FLASH (0x80), Index Byte: SET_NUM_PAGES (0x02),
 *    Write Bytes: 0x00 - Number of pages at byte 0x44 from .msbl file.
 *
 * @param[in] total_pages
 *    Number of pages
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_set_num_pages(uint8_t total_pages)
{
  return write_byte2(BOOTLOADER_FLASH, SET_NUM_PAGES, 0x00, total_pages);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: BOOTLOADER_FLASH (0x80), Index Byte: ERASE_FLASH (0x03)
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_erase_flash(void)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t buf[2];
  uint8_t status;

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  buf[0] = BOOTLOADER_FLASH;
  buf[1] = ERASE_FLASH;

  // Write buffer
  seq.buf[0].data = buf;
  seq.buf[0].len = 2;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = &status;
  seq.buf[0].len = 1;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return status == 0 ? SL_STATUS_OK:SL_STATUS_FAIL;
}

/***************************************************************************//**
 * @brief
 *    Family Byte: BOOTLOADER_INFO (0x81), Index Byte: BOOTLOADER_VERS (0x00).
 *
 * @param[out] bio_hub_vers
 *    Bootloader Version
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_bootloader_vers(bio_hub_version_t *boot_vers)
{
  if (boot_vers == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

