SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  return read_version(BOOTLOADER_INFO, BOOTLOADER_VERS, boot_vers);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: IDENTITY (0xFF), Index Byte: READ_SENSOR_HUB_VERS (0x03).
 *
 * @param[out] bio_hub_vers
 *    HUB Version
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_sensor_hub_version(bio_hub_version_t *bio_hub_vers)
{
  if (bio_hub_vers == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  return read_version(IDENTITY, READ_SENSOR_HUB_VERS, bio_hub_vers);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: IDENTITY (0xFF), Index Byte: READ_ALGO_VERS (0x07).
 *
 * @param[out] lib_algo_vers
 *    algorithm version
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_algorithm_version(bio_hub_version_t *lib_algo_vers)
{
  if (lib_algo_vers == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  return read_version(IDENTITY, READ_SENSOR_HUB_VERS, lib_algo_vers);
}

// ------------------Function Below for MAX32664 Version D (Blood Pressure) ----

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: BPT_MEDICATION (0x00).
 *
 * @param[in] medication
 *    MEDICATION value
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_patient_bp_medication(bool medication)
{
  return write_byte2(CHANGE_ALGORITHM_CONFIG,
                     BPT_CONFIG,
                     BPT_MEDICATION,
                     medication);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: BPT_MEDICATION (0x00).
 *
 * @param[out] medication
 *    MEDICATION value
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_patient_bp_medication(uint8_t *medication)
{
  if (medication == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  return read_byte2(CHANGE_ALGORITHM_CONFIG,
                    BPT_CONFIG,
                    BPT_MEDICATION,
                    medication);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: SYSTOLIC_VALUE (0x01).
 *
 * @param[in] sys_val1, sys_val2, sys_val3
 *    Systolic value
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_systolic_vals(uint8_t sys_val1,
                                        uint8_t sys_val2,
                                        uint8_t sys_val3)
{
  uint8_t sys_vals[3] = { sys_val1, sys_val2, sys_val3 };

  return write_bytes(CHANGE_ALGORITHM_CONFIG,
                     BPT_CONFIG,
                     SYSTOLIC_VALUE,
                     sys_vals,
                     3);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: SYSTOLIC_VALUE (0x01).
 *
 * @param[out] user_array
 *    Systolic value
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_systolic_vals(uint8_t *user_array)
{
  if (user_array == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  return read_multiple_bytes(CHANGE_ALGORITHM_CONFIG,
                             BPT_CONFIG,
                             SYSTOLIC_VALUE,
                             3,
                             user_array);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: DIASTOLIC_VALUE (0x02).
 *
 * @param[in] dias_val1, dias_val2, dias_val3
 *    DIASTOLIC value
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_diastolic_vals(uint8_t dias_val1,
                                         uint8_t dias_val2,
                                         uint8_t dias_val3)
{
  uint8_t dias_vals[3] = { dias_val1, dias_val2, dias_val3 };

  return write_bytes(CHANGE_ALGORITHM_CONFIG,
                     BPT_CONFIG,
                     DIASTOLIC_VALUE,
                     dias_vals,
                     3);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: DIASTOLIC_VALUE (0x02).
 *
 * @param[out] user_array
 *    DIASTOLIC value
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_diastolic_vals(uint8_t *user_array)
{
  if (user_array == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  return read_multiple_bytes(CHANGE_ALGORITHM_CONFIG,
                             BPT_CONFIG,
                             DIASTOLIC_VALUE,
                             3,
                             user_array);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: BPT_CALIB_DATA (0x03).
 *
 * @param[in] bpt_calib_data
 *    Algorithm calibrate data
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_bpt_algo_data(const uint8_t *bpt_calib_data)
{
  if (bpt_calib_data == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

