SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  return write_bytes(CHANGE_ALGORITHM_CONFIG,
                     BPT_CONFIG,
                     BPT_CALIB_DATA,
                     bpt_calib_data,
                     824);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: BPT_CALIB_DATA (0x03).
 *
 * @param[out] user_array
 *    Buffer to read algorithm data
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_bpt_algo_data(uint8_t *user_array)
{
  if (user_array == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  return read_multiple_bytes(CHANGE_ALGORITHM_CONFIG,
                             BPT_CONFIG,
                             BPT_CALIB_DATA,
                             824,
                             user_array);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: PATIENT_RESTING (0x05).
 *
 * @param[in] resting
 *    Patient resting
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_patient_resting(bool resting)
{
  return write_byte2(CHANGE_ALGORITHM_CONFIG,
                     BPT_CONFIG,
                     PATIENT_RESTING,
                     resting);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: PATIENT_RESTING (0x05).
 *
 * @param[out] resting
 *    Patient resting status
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_patient_resting(uint8_t *resting)
{
  if (resting == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  return read_byte2(CHANGE_ALGORITHM_CONFIG,
                    BPT_CONFIG,
                    PATIENT_RESTING,
                    resting);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: AGC_SP02_COEFS (0x0B).
 *
 * @param[in] int_A, int_B, int_C
 *    Algorithm coefficient to be write
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_write_spo2_algo_coef(int32_t int_A,
                                         int32_t int_B,
                                         int32_t int_C)
{
  int32_t coefVals[3] = { int_A, int_B, int_C };

  return write_long_bytes(CHANGE_ALGORITHM_CONFIG,
                          BPT_CONFIG,
                          AGC_SP02_COEFS,
                          coefVals,
                          3);
}

/***************************************************************************//**
 * @brief
 *    Family Byte: CHANGE_ALGORITHM_CONFIG (0x50),
 *    Index Byte: BPT_CONFIG (0x04),
 *    Write Byte: AGC_SP02_COEFS (0x0B).
 *
 * @param[out] user_array
 *    Buffer to read algorithm coefficient data
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t bio_hub_read_spo2_algo_coef(int32_t *user_array)
{
  if (user_array == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Have the user provide their own array here and pass the pointer to it
  return read_multiple_bytes_int(CHANGE_ALGORITHM_CONFIG,
                                 BPT_CONFIG,
                                 AGC_SP02_COEFS,
                                 3,
                                 user_array);
}

// ------------------- Private Functions -----------------------

static sl_status_t read_version(uint8_t family,
                                uint8_t index,
                                bio_hub_version_t *vers)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t buf[4];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  buf[0] = family;
  buf[1] = index;

  // Write buffer
  seq.buf[0].data = buf;
  seq.buf[0].len = 2;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = buf;
  seq.buf[0].len = 4;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  // Pass through if SUCCESS (0x00).
  if (buf[0]) {
    vers->major = 0;
    vers->minor = 0;
    vers->revision = 0;
    return SL_STATUS_FAIL;
  }

  vers->major = buf[1];
  vers->minor = buf[2];
  vers->revision = buf[3];

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function uses the given family, index, and write byte to enable
 *    the given sensor.
 ******************************************************************************/
static sl_status_t enable_write(uint8_t family_byte,
                                uint8_t index_byte,
                                uint8_t enable_byte)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[3];
  uint8_t statusByte;

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = enable_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 3;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(ENABLE_CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = &statusByte;
  seq.buf[0].len = 1;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return statusByte == 0 ? SL_STATUS_OK:SL_STATUS_TRANSMIT;
}

/***************************************************************************//**
 * @brief
 *   This function uses the given family, index, and write byte to communicate
 *   with the MAX32664 which in turn communicates with downward sensors. There
 *   are two steps demonstrated in this function. First a write to the MCU
 *   indicating what you want to do, a delay,
 *   and then a read to confirm positive transmission.
 ******************************************************************************/
static sl_status_t write_byte(uint8_t family_byte,
                              uint8_t index_byte,
                              uint8_t write_byte)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[3];
  uint8_t statusByte;

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = write_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 3;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = &statusByte;
  seq.buf[0].len = 1;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return statusByte == 0 ? SL_STATUS_OK:SL_STATUS_TRANSMIT;
}

/***************************************************************************//**
 * @brief
 *   This function sends information to the MAX32664 to specifically write
 *   values to the registers of downward sensors and so also requires a
 *   register address and register value as parameters.
 *   Again there is the write of the specific bytes followed by
 *   a read to confirm positive transmission.
 ******************************************************************************/
static sl_status_t write_byte2(uint8_t family_byte,
                               uint8_t index_byte,
                               uint8_t write_byte,
                               uint8_t write_val)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[4];
  uint8_t statusByte;

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = write_byte;
  write_buf[3] = write_val;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 4;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = &statusByte;
  seq.buf[0].len = 1;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return statusByte == 0 ? SL_STATUS_OK:SL_STATUS_TRANSMIT;
}

/***************************************************************************//**
 * @brief
 *   This function sends information to the MAX32664 to specifically write
 *   values to the registers of downward sensors and so also requires a
 *   register address and register value as parameters. Again there is the write
 *   of the specific bytes followed by a read to confirm positive transmission.
 ******************************************************************************/
static sl_status_t write_long_bytes(uint8_t family_byte,
                                    uint8_t index_byte,
                                    uint8_t write_byte,
                                    const int32_t *write_val,
                                    const size_t size)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[3];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = write_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 2;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  // Read buffer
  seq.buf[0].data = (uint8_t *)write_val;
  seq.buf[0].len = size * 4;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   This function sends information to the MAX32664 to specifically write
 *   values to the registers of downward sensors and so also requires a
 *   register address and register value as parameters. Again there is the write
 *   of the specific bytes followed by a read to confirm positive transmission.
 ******************************************************************************/
static sl_status_t write_bytes(uint8_t family_byte,
                               uint8_t index_byte,
                               uint8_t write_byte,
                               const uint8_t *write_val,
                               size_t size)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[3];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = write_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 2;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  // Read buffer
  seq.buf[0].data = (uint8_t *)write_val;
  seq.buf[0].len = size;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

