SiliconLabs/third_party_hw_drivers_extension/driver/public/silabs/hr_po_max30101_max32664/src/sparkfun_max30101_max32664.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   This function handles all read commands or stated another way,
 *   all information requests.
 *   It starts a request by writing the family byte an index byte,
 *   and then delays 60 microseconds,
 *   during which the MAX32664 retrieves the requested information.
 *   An I-squared-C request is then issued, and the information is read.
 ******************************************************************************/
static sl_status_t read_byte(uint8_t family_byte,
                             uint8_t index_byte,
                             uint8_t *byte_read)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[2];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 2;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = byte_read;
  seq.buf[0].len = 1;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   This function is exactly as the one above except it accepts also receives a
 *   Write Byte as a parameter. It starts a request by writing the family byte,
 *   index byte, and write byte to the MAX32664 and then delays 60 microseconds,
 *   during which the MAX32664 retrieves the requested information.
 *   A I-squared-C request is then issued, and the information is read.
 ******************************************************************************/
static sl_status_t read_byte2(uint8_t family_byte,
                              uint8_t index_byte,
                              uint8_t write_byte,
                              uint8_t *byte_read)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[3];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = write_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 3;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = byte_read;
  seq.buf[0].len = 1;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return SL_STATUS_OK;
}

static sl_status_t read_fill_array(uint8_t family_byte,
                                   uint8_t index_byte,
                                   uint8_t num_of_reads,
                                   uint8_t *array)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[2];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_WRITE;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 2;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = array;
  seq.buf[0].len = num_of_reads;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *    This function handles all read commands or stated another way,
 *    all information requests.
 *    It starts a request by writing the family byte, an index byte, and
 *    a write byte and then then delays 60 microseconds,
 *    during which the MAX32664 retrieves the requested information.
 *    An I-squared-C request is then issued, and the information is read.
 *    This function is very similar to the one above
 *    except it returns three uint32_t bytes instead of one.
 ******************************************************************************/
static sl_status_t read_multiple_bytes_int(uint8_t family_byte,
                                           uint8_t index_byte,
                                           uint8_t write_byte,
                                           const size_t num_of_reads,
                                           int32_t *user_array)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[3];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = write_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 3;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = (uint8_t *)user_array;
  seq.buf[0].len = num_of_reads * 4;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   This function handles all read commands or stated another way,
 *   all information requests.
 *   It starts a request by writing the family byte, an index byte, and
 *   a write byte and then then delays 60 microseconds,
 *   during which the MAX32664 retrieves the requested information.
 *   An I-squared-C request is then issued,
 *   and the information is read. This function is very similar to the one above
 *   except it returns three uint32_t bytes instead of one.
 ******************************************************************************/
static sl_status_t read_multiple_bytes(uint8_t family_byte,
                                       uint8_t index_byte,
                                       uint8_t write_byte,
                                       const size_t num_of_reads,
                                       uint8_t *user_array)
{
  I2C_TransferSeq_TypeDef seq;
  uint8_t write_buf[3];

  if (bio_hub_i2cspm_instance == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  write_buf[0] = family_byte;
  write_buf[1] = index_byte;
  write_buf[2] = write_byte;

  // Write buffer
  seq.buf[0].data = write_buf;
  seq.buf[0].len = 3;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }

  sl_sleeptimer_delay_millisecond(CMD_DELAY);

  seq.addr = i2c_address << 1;
  seq.flags = I2C_FLAG_READ;

  // Read buffer
  seq.buf[0].data = user_array;
  seq.buf[0].len = num_of_reads;

  if (I2CSPM_Transfer(bio_hub_i2cspm_instance, &seq) != i2cTransferDone) {
    return SL_STATUS_TRANSMIT;
  }
  return SL_STATUS_OK;
}
